create_clock -period 62.500 -name VIRTUAL_clk_out1_clk_wiz_0 -waveform {0.000 31.250}
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -min -add_delay 0.020 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -max -add_delay 0.020 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -min -add_delay 0.020 [get_ports rx]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -max -add_delay 0.020 [get_ports rx]
#set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -min -add_delay 0.000 [get_ports {led_state_conv[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -max -add_delay 0.020 [get_ports {led_state_conv[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -min -add_delay 0.000 [get_ports {led_state_uart[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -max -add_delay 0.020 [get_ports {led_state_uart[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -min -add_delay 0.000 [get_ports tx]
#set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clk_wiz_0] -max -add_delay 0.020 [get_ports tx]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets reset_IBUF]
set_property IOSTANDARD LVCMOS33 [get_ports {led_state_conv[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_state_conv[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_state_conv[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_state_uart[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_state_uart[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led_state_uart[0]}]
set_property PACKAGE_PIN T14 [get_ports {led_state_conv[3]}]
set_property PACKAGE_PIN T15 [get_ports {led_state_conv[2]}]
set_property PACKAGE_PIN T16 [get_ports {led_state_conv[1]}]
set_property PACKAGE_PIN U16 [get_ports {led_state_conv[0]}]
set_property PACKAGE_PIN V15 [get_ports {led_state_uart[2]}]
set_property PACKAGE_PIN W16 [get_ports {led_state_uart[1]}]
set_property PACKAGE_PIN W15 [get_ports {led_state_uart[0]}]
set_property PACKAGE_PIN R4 [get_ports clk]
set_property PACKAGE_PIN E22 [get_ports reset]
set_property PACKAGE_PIN V18 [get_ports rx]
set_property PACKAGE_PIN AA19 [get_ports tx]
set_property IOSTANDARD LVCMOS33 [get_ports clk]
set_property IOSTANDARD LVCMOS33 [get_ports reset]
set_property IOSTANDARD LVCMOS33 [get_ports rx]
set_property IOSTANDARD LVCMOS33 [get_ports tx]

set_property IOSTANDARD LVCMOS33 [get_ports {led_state_conv[3]}]
